In [2]:
import pandas as pd
from sqlalchemy import create_engine
import warnings
import numpy as np

warnings.filterwarnings("ignore")

/var/folders/lk/mcqlnwdj19b1wj09y1h_xf0c0000gn/T/ipykernel_83667/3620706049.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
# Предварительно необходимо создать БД hw2:
postgres_str = f'postgresql://postgres:geheim@localhost:5432/hw2'
cnx = create_engine(postgres_str)

In [4]:
customer_df = pd.read_csv("../data/customer.csv", sep=";")
transaction_df = pd.read_csv("../data/transaction.csv", sep=";", decimal=",")

In [42]:
transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    20000 non-null  int64
 1   product_id        20000 non-null  int64
 2   customer_id       20000 non-null  int64
 3   transaction_date  20000 non-null  object
 4   online_order      19640 non-null  object
 5   order_status      20000 non-null  object
 6   brand             19803 non-null  object
 7   product_line      19803 non-null  object
 8   product_class     19803 non-null  object
 9   product_size      19803 non-null  object
 10  list_price        20000 non-null  float64
 11  standard_cost     19803 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 1.8+ MB

In [43]:
from sqlalchemy.sql import text

drop_customer_tbl_q = "DROP TABLE IF EXISTS customer"
drop_transaction_tbl_q = "DROP TABLE IF EXISTS transaction"
create_customer_tbl_q = """
    CREATE TABLE customer (
        customer_id int primary key,
        first_name varchar(50),
        last_name varchar(50),
        gender varchar(30),
        DOB varchar(50),
        job_title varchar(50),
        job_industry_category varchar(50),
        wealth_segment varchar(50),
        deceased_indicator varchar(50),
        owns_car varchar(30),
        address varchar(50),
        postcode varchar(30),
        state varchar(30),
        country varchar(30),
        property_valuation int
    )
"""
create_transaction_tbl_q = """
    CREATE TABLE transaction (
        transaction_id int primary key,
        product_id int,
        customer_id int,
        transaction_date varchar(30),
        online_order varchar(30),
        order_status varchar(30),
        brand varchar(30),
        product_line varchar(30),
        product_class varchar(30),
        product_size varchar(30),
        list_price float,
        standard_cost float
    )
"""
with cnx.connect() as conn:
    conn.execute(text(drop_customer_tbl_q))
    conn.execute(text(drop_transaction_tbl_q))
    conn.execute(text(create_customer_tbl_q))
    conn.execute(text(create_transaction_tbl_q))
    conn.commit()

In [44]:
customer_df.rename(columns={'DOB': 'dob'}, inplace=True)

In [45]:
customer_df.to_sql("customer", con=cnx, index=False, if_exists="append")
transaction_df.to_sql("transaction", con=cnx, index=False, if_exists="append")

1000

In [54]:
# 1. Вывести все уникальные бренды, у которых стандартная стоимость выше 1500 долларов.
brand_df = pd.read_sql_query("SELECT DISTINCT brand FROM transaction WHERE standard_cost > 1500", cnx)
brand_df

            brand
0      OHM Cycles
1   Trek Bicycles
2           Solex
3  Giant Bicycles

In [131]:
# 2. Вывести все подтвержденные транзакции за период '2017-04-01' по '2017-04-09' включительно.
query = """
    SELECT * FROM transaction 
    WHERE to_date(transaction_date, 'DD.MM.YYYY')  >= '2017-04-01' 
    AND to_date(transaction_date, 'DD.MM.YYYY') <= '2017-04-09' 
    AND order_status = 'Approved' ORDER BY transaction_date 
"""
tx_df = pd.read_sql_query(query, cnx)
tx_df

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,15576,68,2820,01.04.2017,true,Approved,OHM Cycles,Standard,medium,medium,1636.90,44.71
1,16621,90,2072,01.04.2017,false,Approved,Norco Bicycles,Standard,low,medium,363.01,290.41
2,2146,8,3096,01.04.2017,true,Approved,Solex,Road,medium,small,1703.52,1516.13
3,15488,64,906,01.04.2017,true,Approved,Giant Bicycles,Standard,high,small,1977.36,1759.85
4,5922,8,1831,01.04.2017,true,Approved,Solex,Road,medium,small,1703.52,1516.13
...,...,...,...,...,...,...,...,...,...,...,...,...
526,14640,49,3176,09.04.2017,false,Approved,Trek Bicycles,Road,medium,medium,533.51,400.13
527,14319,76,240,09.04.2017,true,Approved,WeareA2B,Road,low,small,1172.78,1043.77
528,14720,59,2111,09.04.2017,true,Approved,Solex,Standard,medium,large,1061.56,733.58
529,13567,76,102,09.04.2017,false,Approved,WeareA2B,Standard,low,medium,642.31,513.85
530,15304,63,3160,09.04.2017,None,Approved,Solex,Standard,medium,medium,1483.20,99.59

In [128]:
# 3. Вывести все профессии у клиентов из сферы IT или Financial Services, которые начинаются с фразы 'Senior'.
# occ_df = pd.read_sql_query("select distinct job_title from customer where job_industry_category in ('IT', 'Financial Services') and job_title like 'Senior%'", cnx)
# occ_df
# - средствами pandas like c '%' почему-то не работает
query = "SELECT DISTINCT job_title FROM customer WHERE job_industry_category IN ('IT', 'Financial Services') AND job_title LIKE 'Senior%'"
with cnx.connect() as conn:
    res = conn.execute(text(query)).scalars().all()
    df = pd.DataFrame(res, columns=['job_title'])
    print(df)

                  job_title
0    Senior Cost Accountant
1          Senior Developer
2             Senior Editor
3  Senior Financial Analyst
4   Senior Quality Engineer
5    Senior Sales Associate

In [108]:
# 4. Вывести все бренды, которые закупают клиенты, работающие в сфере Financial Services
query = """
    SELECT DISTINCT brand FROM transaction t 
    INNER JOIN customer c ON c.customer_id = t.customer_id 
    WHERE job_industry_category = 'Financial Services' AND brand is not null
"""
brand_finances_df = pd.read_sql_query(query, cnx)
brand_finances_df

            brand
0      OHM Cycles
1   Trek Bicycles
2        WeareA2B
3           Solex
4  Norco Bicycles
5  Giant Bicycles

In [114]:
# 5. Вывести 10 клиентов, которые оформили онлайн-заказ продукции из брендов 'Giant Bicycles', 'Norco Bicycles', 'Trek Bicycles'.

query = """
    SELECT DISTINCT c.* FROM customer c
    INNER JOIN transaction t ON c.customer_id = t.customer_id 
    WHERE t.brand in ('Giant Bicycles', 'Norco Bicycles', 'Trek Bicycles')
    LIMIT 10
"""
clients_by_brands_df = pd.read_sql_query(query, cnx)
clients_by_brands_df

,customer_id,first_name,last_name,gender,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,552,Hilly,Kleinmann,Male,1978-09-09,Geological Engineer,Manufacturing,High Net Worth,N,Yes,06008 Anthes Pass,2478,NSW,Australia,8
1,3409,Abbey,Nellen,Female,1977-04-29,Desktop Support Technician,Argiculture,Mass Customer,N,No,687 Almo Crossing,2160,NSW,Australia,10
2,1014,Miller,Faloon,Male,1960-10-14,Senior Developer,Property,Mass Customer,N,Yes,3 Hayes Court,3109,VIC,Australia,10
3,445,Timothy,Wenham,Male,1984-11-13,Executive Secretary,Financial Services,Mass Customer,N,No,261 Northport Lane,2567,NSW,Australia,7
4,1897,Cosette,Callar,Female,1997-08-20,Product Engineer,None,Mass Customer,N,Yes,3 Manley Crossing,4074,QLD,Australia,6
5,2091,Dominga,Crosfield,Female,1980-06-22,Office Assistant II,Argiculture,Mass Customer,N,No,158 Lindbergh Crossing,3136,VIC,Australia,9
6,1035,Kara-lynn,Doddridge,Female,1976-11-02,Operator,Retail,Affluent Customer,N,Yes,3082 Almo Center,2454,NSW,Australia,4
7,237,Reginald,Dartan,Male,1974-03-07,Account Coordinator,Property,High Net Worth,N,Yes,39988 Porter Pass,4152,QLD,Australia,7
8,453,Cornelius,Yarmouth,U,None,Assistant Professor,IT,High Net Worth,N,No,7 Farmco Trail,2759,NSW,Australia,9
9,2231,Rasla,Landreth,Female,1959-09-25,Accounting Assistant II,None,Mass Customer,N,No,0 Mifflin Alley,4818,QLD,Australia,5

In [115]:
# 6. Вывести всех клиентов, у которых нет транзакций.

query = """
    SELECT DISTINCT c.* FROM customer c
    LEFT JOIN transaction t ON c.customer_id = t.customer_id 
    WHERE t.transaction_id IS NULL
"""
clients_no_tx_df = pd.read_sql_query(query, cnx)
clients_no_tx_df

,customer_id,first_name,last_name,gender,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,852,Andie,Bonney,Female,2000-11-04,Compensation Analyst,Financial Services,Affluent Customer,N,Yes,94 Anhalt Way,3139,VIC,Australia,7
1,869,Addia,Abels,Female,1984-03-11,Account Representative I,Financial Services,High Net Worth,N,Yes,02377 Maywood Trail,2287,NSW,Australia,7
2,1373,Shaylynn,Epsley,Female,1958-09-23,Director of Sales,Financial Services,Mass Customer,N,Yes,0 Grasskamp Pass,3170,VIC,Australia,10
3,2074,Roslyn,Rawdall,Female,1997-06-11,None,Financial Services,Mass Customer,N,No,95483 Washington Junction,2505,NSW,Australia,9
4,2660,Hunt,Scollard,Male,1963-11-15,None,Retail,High Net Worth,N,Yes,359 Briar Crest Road,2155,NSW,Australia,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
502,3996,Rosalia,Halgarth,Female,1975-08-09,VP Product Management,Health,Mass Customer,N,No,57042 Village Green Point,4511,QLD,Australia,6
503,3997,Blanch,Nisuis,Female,2001-07-13,Statistician II,Manufacturing,High Net Worth,N,Yes,87 Crescent Oaks Alley,2756,NSW,Australia,10
504,3998,Sarene,Woolley,U,None,Assistant Manager,IT,High Net Worth,N,No,8194 Lien Street,4032,QLD,Australia,7
505,3999,Patrizius,None,Male,1973-10-24,None,Manufacturing,Affluent Customer,N,Yes,320 Acker Drive,2251,NSW,Australia,7
506,4000,Kippy,Oldland,Male,1991-11-05,Software Engineer IV,None,Affluent Customer,N,No,613 Erie Lane,3996,NSW,Australia,10

In [136]:
# 7. Вывести всех клиентов из IT, у которых транзакции с максимальной стандартной стоимостью.

query = """
    SELECT DISTINCT c.*, t.standard_cost FROM customer c
    INNER JOIN transaction t ON c.customer_id = t.customer_id 
    WHERE c.job_industry_category = 'IT' AND t.standard_cost = (SELECT MAX(standard_cost) FROM transaction)
"""
clients_it_max_cost_df = pd.read_sql_query(query, cnx)
clients_it_max_cost_df

,customer_id,first_name,last_name,gender,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation,standard_cost
0,34,Jephthah,Bachmann,U,1843-12-21,Legal Assistant,IT,Affluent Customer,N,No,90 Lawn Parkway,4805,QLD,Australia,4,1759.85
1,893,Gibby,Fearnley,Male,1983-09-11,Geologist I,IT,Mass Customer,N,No,6382 Bayside Street,2153,NSW,Australia,10,1759.85
2,975,Goldarina,Rzehorz,U,None,Automation Specialist IV,IT,Mass Customer,N,No,938 Monica Park,3173,VIC,Australia,9,1759.85
3,1672,Sharla,Creebo,Female,1963-04-27,Design Engineer,IT,Affluent Customer,N,Yes,1 Morning Circle,2250,NSW,Australia,8,1759.85
4,1773,Nickolas,Guittet,U,None,None,IT,Mass Customer,N,Yes,835 West Hill,2118,NSW,Australia,11,1759.85
5,1918,Devin,Sandeson,U,None,Staff Accountant II,IT,Affluent Customer,N,No,51763 Carey Place,3056,VIC,Australia,7,1759.85
6,2913,Padraic,Bonnar,Male,1955-07-11,VP Quality Control,IT,Affluent Customer,N,Yes,937 Sloan Center,4118,QLD,Australia,6,1759.85
7,3151,Thorn,Choffin,U,None,Senior Developer,IT,Affluent Customer,N,Yes,5323 Chive Avenue,2486,NSW,Australia,7,1759.85
8,3473,Sanderson,Alloway,U,None,Analog Circuit Design manager,IT,Mass Customer,N,No,3 Roxbury Street,2261,NSW,Australia,7,1759.85

In [6]:
# 8. Вывести всех клиентов из сферы IT и Health, у которых есть подтвержденные транзакции за период '2017-07-07' по '2017-07-17'.

query = """
    SELECT DISTINCT c.* FROM customer c
    LEFT JOIN transaction t ON t.customer_id = c.customer_id
    WHERE c.job_industry_category in ('IT', 'Health')
    AND to_date(transaction_date, 'DD.MM.YYYY') >= '2017-07-07'
    AND to_date(transaction_date, 'DD.MM.YYYY') <= '2017-07-17'
    AND order_status = 'Approved'
"""
it_and_health_df = pd.read_sql_query(query, cnx)
it_and_health_df

,customer_id,first_name,last_name,gender,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,22,Deeanne,Durtnell,Female,1962-12-10,None,IT,Mass Customer,N,No,52 Carey Alley,4740,QLD,Australia,5
1,28,Fee,Zellmer,Male,1973-09-30,Senior Quality Engineer,Health,Affluent Customer,N,Yes,2951 Petterle Place,2756,New South Wales,Australia,9
2,41,Basilius,Coupe,Male,1976-04-14,Food Chemist,Health,Mass Customer,N,No,2028 Lakewood Place,2480,New South Wales,Australia,3
3,47,Matthew,Jeaycock,Male,1992-10-22,Registered Nurse,Health,Affluent Customer,N,No,4853 Gulseth Avenue,4503,QLD,Australia,5
4,104,Odille,Panketh,Female,1978-06-06,Automation Specialist II,Health,Mass Customer,N,Yes,0410 Division Junction,2750,New South Wales,Australia,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
110,3255,Sutherlan,Truin,U,None,Engineer IV,IT,High Net Worth,N,No,12357 Arapahoe Parkway,4740,QLD,Australia,3
111,3288,Fair,Dewen,U,None,Engineer III,IT,High Net Worth,N,No,6 Golf Center,2042,NSW,Australia,10
112,3360,Joelie,Sherlaw,Female,1963-03-23,Quality Engineer,Health,Affluent Customer,N,No,62551 Del Mar Avenue,2300,NSW,Australia,6
113,3365,Karlens,Chaffyn,U,None,Engineer III,IT,Mass Customer,N,No,7234 Dawn Alley,4670,QLD,Australia,1
114,3482,Roch,Rilston,Female,2000-05-18,Clinical Specialist,Health,Affluent Customer,N,Yes,8934 Havey Plaza,2548,NSW,Australia,8